doc수정, 레이아웃 수정
